SOAAssignment11/SOAPMessages.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>student@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>student@smail.nju.edu.cn</email><id>3</id><identity>student</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学号 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">141250179</ns3:学号></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns3:学生 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema" 学号="141250179"><年级>大三</年级><ns2:基本信息><姓名>yyy</姓名><性别>女</性别><教育背景>本科</教育背景><婚姻状况>未婚</婚姻状况><手机号码>18260098869</手机号码><部门 部门名称="软件学院" 部门属性="院" 部门编号="141250"><部门主管>陈琳</部门主管><部门描述>software</部门描述></部门><地址/><座机号码>05286532130</座机号码></ns2:基本信息><课程成绩列表><课程成绩 成绩性质="总评成绩" 课程编号="10002"><成绩><学号>141250179</学号><得分>80</得分></成绩></课程成绩><课程成绩 成绩性质="总评成绩" 课程编号="10003"><成绩><学号>141250179</学号><得分>93</得分></成绩></课程成绩></课程成绩列表></ns3:学生></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>teacher@smail.nju.edu.cn</email><id>2</id><identity>teacher</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学生 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema" 学号="141250124"><年级>大三</年级><ns2:基本信息><姓名>汤大业</姓名><性别>男</性别><教育背景>本科</教育背景><婚姻状况>未婚</婚姻状况><手机号码>183xxxx6292</手机号码><部门 部门名称="软件学院" 部门属性="院" 部门编号="141250"><部门主管>xx</部门主管><部门描述>软件学院</部门描述></部门><地址><省份>江苏省</省份><城市>南京市</城市><区>鼓楼区</区><街道>汉口路</街道><号>22号</号></地址><座机号码>1234-5678</座机号码></ns2:基本信息><课程成绩列表><课程成绩 成绩性质="作业成绩" 课程编号="001"><成绩><学号>141250124</学号><得分>100</得分></成绩></课程成绩></课程成绩列表></ns3:学生></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns3:学生 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema" 学号="141250124"><年级>大三</年级><ns2:基本信息><姓名>汤大业</姓名><性别>男</性别><教育背景>本科</教育背景><婚姻状况>未婚</婚姻状况><手机号码>183xxxx6292</手机号码><部门 部门名称="软件学院" 部门属性="院" 部门编号="141250"><部门主管>xx</部门主管><部门描述>软件学院</部门描述></部门><地址><省份>江苏省</省份><城市>南京市</城市><区>鼓楼区</区><街道>汉口路</街道><号>22号</号></地址><座机号码>1234-5678</座机号码></ns2:基本信息><课程成绩列表><课程成绩 成绩性质="作业成绩" 课程编号="001"><成绩><学号>141250124</学号><得分>100</得分></成绩></课程成绩></课程成绩列表></ns3:学生></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学号 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">141250124</ns3:学号></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns3:学生 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema" 学号="141250124"><年级>大三</年级><ns2:基本信息><姓名>汤大业</姓名><性别>男</性别><教育背景>本科</教育背景><婚姻状况>未婚</婚姻状况><手机号码>183xxxx6292</手机号码><部门 部门名称="软件学院" 部门属性="院" 部门编号="141250"><部门主管>陈琳</部门主管><部门描述>software</部门描述></部门><地址><省份>江苏省</省份><城市>南京市</城市><区>鼓楼区</区><街道>汉口路</街道><号>22号</号></地址><座机号码>1234-5678</座机号码></ns2:基本信息><课程成绩列表><课程成绩 成绩性质="作业成绩" 课程编号="001"><成绩><学号>141250124</学号><得分>100</得分></成绩></课程成绩></课程成绩列表></ns3:学生></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学号 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">141250123</ns3:学号></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>Student ID not exists</faultstring><detail><ns3:学号错误 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">pStudent ID not exists</ns3:学号错误></detail></soap:Fault></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学号类型 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema"><学号>141250124</学号></ns3:学号类型></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns3:学生 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema" 学号="141250124"><年级>大三</年级><ns2:基本信息><姓名>汤大业</姓名><性别>男</性别><教育背景>本科</教育背景><婚姻状况>未婚</婚姻状况><手机号码>183xxxx6292</手机号码><部门 部门名称="软件学院" 部门属性="院" 部门编号="141250"><部门主管>陈琳</部门主管><部门描述>software</部门描述></部门><地址><省份>江苏省</省份><城市>南京市</城市><区>鼓楼区</区><街道>汉口路</街道><号>22号</号></地址><座机号码>1234-5678</座机号码></ns2:基本信息><课程成绩列表><课程成绩 成绩性质="作业成绩" 课程编号="001"><成绩><学号>141250124</学号><得分>100</得分></成绩></课程成绩></课程成绩列表></ns3:学生></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns3:学号 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">141250124</ns3:学号></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>Student ID not exists</faultstring><detail><ns3:学号错误 xmlns:ns2="http://www.nju.edu.cn/schema" xmlns:ns3="http://jw.nju.edu.cn/schema">pStudent ID not exists</ns3:学号错误></detail></soap:Fault></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>none@smail.nju.edu.cn</email><password>123</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><ns2:loginResponse xmlns:ns2="http://service.student.nju.edu/"><return><email>none@smail.nju.edu.cn</email><id>4</id><identity>none</identity><password>123</password></return></ns2:loginResponse></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password>12</password></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>email or password wrong</faultstring><detail/></soap:Fault></soap:Body></soap:Envelope>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><S:Body><ns2:login xmlns:ns2="http://service.student.nju.edu/"><email>teacher@smail.nju.edu.cn</email><password/></ns2:login></S:Body></S:Envelope>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><soap:Fault><faultcode>soap:Server</faultcode><faultstring>login</faultstring><detail/></soap:Fault></soap:Body></soap:Envelope>
